In [81]:
#1 . Write a Python program to connect to MySQL and print the list of all available databases. 
import mysql.connector

In [133]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Revanth123/",
    database="schools_db"  
)
print(conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000016D7F7B6990>

In [134]:
#2. Create a function in Python to create the tables (students, courses, enrollments) in school_db. 
cursor = conn.cursor()
cursor.execute("CREATE DATABASE schools_db")

DatabaseError: 1007 (HY000): Can't create database 'schools_db'; database exists

In [ ]:
cursor.execute("USE schools_db")
cursor.execute("DROP TABLE IF EXISTS enrollments")
cursor.execute("DROP TABLE IF EXISTS courses")
cursor.execute("DROP TABLE IF EXISTS students")

cursor.execute("""
CREATE TABLE students (
    student_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    grade VARCHAR(10)
)""")
print("Table 'students' created.")

cursor.execute("""
CREATE TABLE courses (
    course_id INT AUTO_INCREMENT PRIMARY KEY,
    course_name VARCHAR(100),
    credits INT
)
""")
print(" Table 'courses' created.")

cursor.execute("""
CREATE TABLE enrollments (
    enrollment_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES students(student_id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
)
""")
print(" Table 'enrollments' created.")

Table 'students' created.
 Table 'courses' created.
 Table 'enrollments' created.

In [ ]:
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('courses',)
('enrollments',)
('students',)

#3. Write a Python program to insert multiple students and courses into the respective tables using executemany().

In [ ]:
import pandas as pd

df_courses = pd.read_csv("./students.csv", usecols=["name", "age","grade"])
vals_students = [tuple(x) for x in df_courses.to_numpy()]

sql_students = "INSERT INTO students (name, age , grade ) VALUES (%s, %s, %s)"
cursor.executemany(sql_students, vals_students)
print(cursor.rowcount, "student records inserted.")

df_courses = pd.read_csv("./courses.csv", usecols=["course_name"])
vals_courses = [tuple(x) for x in df_courses.to_numpy()]

sql_courses = "INSERT INTO courses (course_name) VALUES (%s)"
cursor.executemany(sql_courses, vals_courses)
print(cursor.rowcount, "course records inserted.")

conn.commit()
cursor.close()

100 student records inserted.
10 course records inserted.

In [ ]:
#4 . Fetch and print all rows from the students table in a tabular format. 
cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()                               #discription
columns = [desc[0] for desc in cursor.description]     # extracts only the column names 

df = pd.DataFrame(rows, columns=columns)               #column header 
print("\n Students Table:")
print(df.to_string(index=False))                       

cursor.close()

 Students Table:
 student_id     name  age grade
          1    Zane1   18  None
          2     Uma2   23  None
          3   Wendy3   22  None
          4  Xander4   22  None
          5  Victor5   19  None
          6     Ian6   19  None
          7     Leo7   22  None
          8    Paul8   24  None
          9   Wendy9   23  None
         10    Leo10   23  None
         11    Uma11   18  None
         12   Rita12   18  None
         13   Yara13   22  None
         14    Bob14   19  None
         15 Quincy15   24  None
         16   Tina16   19  None
         17  Alice17   25  None
         18    Sam18   20  None
         19   Paul19   23  None
         20 Victor20   19  None
         21  Frank21   23  None
         22 Victor22   18  None
         23  Karen23   25  None
         24  Grace24   24  None
         25 Quincy25   25  None
         26   Mona26   20  None
         27    Uma27   22  None
         28   Nina28   23  None
         29    Ian29   23  None
         30   Tina30   23  None
         31   Nina31   22  None
         32 Hannah32   21  None
         33  David33   25  None
         34  Wendy34   22  None
         35  Frank35   25  None
         36   Paul36   22  None
         37    Ian37   21  None
         38   Paul38   20  None
         39 Hannah39   18  None
         40   Zane40   21  None
         41    Ian41   24  None
         42 Quincy42   24  None
         43 Quincy43   25  None
         44   Tina44   19  None
         45 Xander45   23  None
         46   Zane46   25  None
         47    Eva47   19  None
         48    Leo48   22  None
         49    Uma49   25  None
         50    Bob50   22  None
         51  Karen51   18  None
         52 Hannah52   23  None
         53    Bob53   21  None
         54    Leo54   18  None
         55   Yara55   22  None
         56    Eva56   19  None
         57   Nina57   21  None
         58    Eva58   20  None
         59  Oscar59   21  None
         60   Yara60   18  None
         61  Oscar61   23  None
         62   Rita62   23  None
         63 Victor63   20  None
         64 Xander64   19  None
         65 Hannah65   22  None
         66   Nina66   25  None
         67 Victor67   18  None
         68  Karen68   18  None
         69  Grace69   18  None
         70   Jack70   24  None
         71   Nina71   23  None
         72    Ian72   22  None
         73  Grace73   19  None
         74  Grace74   24  None
         75 Quincy75   23  None
         76  Oscar76   19  None
         77  Grace77   22  None
         78    Ian78   22  None
         79 Xander79   24  None
         80   Tina80   22  None
         81  Wendy81   20  None
         82  Karen82   23  None
         83    Leo83   18  None
         84    Bob84   18  None
         85   Rita85   18  None
         86  Alice86   21  None
         87    Sam87   19  None
         88  Wendy88   23  None
         89   Tina89   21  None
         90   Zane90   25  None
         91   Tina91   21  None
         92  Wendy92   19  None
         93 Quincy93   19  None
         94    Eva94   24  None
         95   Tina95   25  None
         96    Ian96   25  None
         97   Mona97   22    +A
         98    Leo98   25  None
         99    Bob99   23    B+
        100  Paul100   19  None
        101    Zane1   18     C
        102     Uma2   23     A
        103   Wendy3   22     B
        104  Xander4   22     A
        105  Victor5   19     A
        106     Ian6   19     D
        107     Leo7   22     A
        108    Paul8   24     B
        109   Wendy9   23     B
        110    Leo10   23     A
        111    Uma11   18     C
        112   Rita12   18     B
        113   Yara13   22     B
        114    Bob14   19     C
        115 Quincy15   24     A
        116   Tina16   19     A
        117  Alice17   25     B
        118    Sam18   20     B
        119   Paul19   23     A
        120 Victor20   19     D
        121  Frank21   23     A
        122 Victor22   18     A
        123  Karen23   25     A
        124  Grace24   24     D
        125 Quincy25   25     A
        126   Mona26   20     D
        127    Uma27   22     B
        128   Nina28   23     B
        129    Ian29   23     B
        130   Tina30   23     A
        131   Nina31   22     B
        132 Hannah32   21     A
        133  David33   25     D
        134  Wendy34   22     B
        135  Frank35   25     C
        136   Paul36   22     D
        137    Ian37   21     D
        138   Paul38   20     C
        139 Hannah39   18     A
        140   Zane40   21     A
        141    Ian41   24     D
        142 Quincy42   24     C
        143 Quincy43   25     D
        144   Tina44   19     C
        145 Xander45   23     C
        146   Zane46   25     C
        147    Eva47   19     D
        148    Leo48   22     B
        149    Uma49   25     A
        150    Bob50   22     D
        151  Karen51   18     A
        152 Hannah52   23     A
        153    Bob53   21     C
        154    Leo54   18     C
        155   Yara55   22     A
        156    Eva56   19     C
        157   Nina57   21     B
        158    Eva58   20     A
        159  Oscar59   21     B
        160   Yara60   18     B
        161  Oscar61   23     D
        162   Rita62   23     C
        163 Victor63   20     D
        164 Xander64   19     D
        165 Hannah65   22     D
        166   Nina66   25     D
        167 Victor67   18     A
        168  Karen68   18     A
        169  Grace69   18     D
        170   Jack70   24     A
        171   Nina71   23     B
        172    Ian72   22     D
        173  Grace73   19     A
        174  Grace74   24     C
        175 Quincy75   23     D
        176  Oscar76   19     D
        177  Grace77   22     D
        178    Ian78   22     D
        179 Xander79   24     C
        180   Tina80   22     D
        181  Wendy81   20     A
        182  Karen82   23     B
        183    Leo83   18     C
        184    Bob84   18     A
        185   Rita85   18     A
        186  Alice86   21     B
        187    Sam87   19     C
        188  Wendy88   23     A
        189   Tina89   21     C
        190   Zane90   25     D
        191   Tina91   21     D
        192  Wendy92   19     C
        193 Quincy93   19     A
        194    Eva94   24     C
        195   Tina95   25     D
        196    Ian96   25     C
        197   Mona97   22     C
        198    Leo98   25     A
        199    Bob99   23     C
        200  Paul100   19     B
        201    Zane1   18     C
        202     Uma2   23     A
        203   Wendy3   22     B
        204  Xander4   22     A
        205  Victor5   19     A
        206     Ian6   19     D
        207     Leo7   22     A
        208    Paul8   24     B
        209   Wendy9   23     B
        210    Leo10   23     A
        211    Uma11   18     C
        212   Rita12   18     B
        213   Yara13   22     B
        214    Bob14   19     C
        215 Quincy15   24     A
        216   Tina16   19     A
        217  Alice17   25     B
        218    Sam18   20     B
        219   Paul19   23     A
        220 Victor20   19     D
        221  Frank21   23     A
        222 Victor22   18     A
        223  Karen23   25     A
        224  Grace24   24     D
        225 Quincy25   25     A
        226   Mona26   20     D
        227    Uma27   22     B
        228   Nina28   23     B
        229    Ian29   23     B
        230   Tina30   23     A
        231   Nina31   22     B
        232 Hannah32   21     A
        233  David33   25     D
        234  Wendy34   22     B
        235  Frank35   25     C
        236   Paul36   22     D
        237    Ian37   21     D
        238   Paul38   20     C
        239 Hannah39   18     A
        240   Zane40   21     A
        241    Ian41   24     D
        242 Quincy42   24     C
        243 Quincy43   25     D
        244   Tina44   19     C
        245 Xander45   23     C
        246   Zane46   25     C
        247    Eva47   19     D
        248    Leo48   22     B
        249    Uma49   25     A
        250    Bob50   22     D
        251  Karen51   18     A
        252 Hannah52   23     A
        253    Bob53   21     C
        254    Leo54   18     C
        255   Yara55   22     A
        256    Eva56   19     C
        257   Nina57   21     B
        258    Eva58   20     A
        259  Oscar59   21     B
        260   Yara60   18     B
        261  Oscar61   23     D
        262   Rita62   23     C
        263 Victor63   20     D
        264 Xander64   19     D
        265 Hannah65   22     D
        266   Nina66   25     D
        267 Victor67   18     A
        268  Karen68   18     A
        269  Grace69   18     D
        270   Jack70   24     A
        271   Nina71   23     B
        272    Ian72   22     D
        273  Grace73   19     A
        274  Grace74   24     C
        275 Quincy75   23     D
        276  Oscar76   19     D
        277  Grace77   22     D
        278    Ian78   22     D
        279 Xander79   24     C
        280   Tina80   22     D
        281  Wendy81   20     A
        282  Karen82   23     B
        283    Leo83   18     C
        284    Bob84   18     A
        285   Rita85   18     A
        286  Alice86   21     B
        287    Sam87   19     C
        288  Wendy88   23     A
        289   Tina89   21     C
        290   Zane90   25     D
        291   Tina91   21     D
        292  Wendy92   19     C
        293 Quincy93   19     A
        294    Eva94   24     C
        295   Tina95   25     D
        296    Ian96   25     C
        297   Mona97   22     C
        298    Leo98   25     A
        299    Bob99   23     C
        300  Paul100   19     B
        301    Zane1   18     C
        302     Uma2   23     A
        303   Wendy3   22     B
        304  Xander4   22     A
        305  Victor5   19     A
        306     Ian6   19     D
        307     Leo7   22     A
        308    Paul8   24     B
        309   Wendy9   23     B
        310    Leo10   23     A
        311    Uma11   18     C
        312   Rita12   18     B
        313   Yara13   22     B
        314    Bob14   19     C
        315 Quincy15   24     A
        316   Tina16   19     A
        317  Alice17   25     B
        318    Sam18   20     B
        319   Paul19   23     A
        320 Victor20   19     D
        321  Frank21   23     A
        322 Victor22   18     A
        323  Karen23   25     A
        324  Grace24   24     D
        325 Quincy25   25     A
        326   Mona26   20     D
        327    Uma27   22     B
        328   Nina28   23     B
        329    Ian29   23     B
        330   Tina30   23     A
        331   Nina31   22     B
        332 Hannah32   21     A
        333  David33   25     D
        334  Wendy34   22     B
        335  Frank35   25     C
        336   Paul36   22     D
        337    Ian37   21     D
        338   Paul38   20     C
        339 Hannah39   18     A
        340   Zane40   21     A
        341    Ian41   24     D
        342 Quincy42   24     C
        343 Quincy43   25     D
        344   Tina44   19     C
        345 Xander45   23     C
        346   Zane46   25     C
        347    Eva47   19     D
        348    Leo48   22     B
        349    Uma49   25     A
        350    Bob50   22     D
        351  Karen51   18     A
        352 Hannah52   23     A
        353    Bob53   21     C
        354    Leo54   18     C
        355   Yara55   22     A
        356    Eva56   19     C
        357   Nina57   21     B
        358    Eva58   20     A
        359  Oscar59   21     B
        360   Yara60   18     B
        361  Oscar61   23     D
        362   Rita62   23     C
        363 Victor63   20     D
        364 Xander64   19     D
        365 Hannah65   22     D
        366   Nina66   25     D
        367 Victor67   18     A
        368  Karen68   18     A
        369  Grace69   18     D
        370   Jack70   24     A
        371   Nina71   23     B
        372    Ian72   22     D
        373  Grace73   19     A
        374  Grace74   24     C
        375 Quincy75   23     D
        376  Oscar76   19     D
        377  Grace77   22     D
        378    Ian78   22     D
        379 Xander79   24     C
        380   Tina80   22     D
        381  Wendy81   20     A
        382  Karen82   23     B
        383    Leo83   18     C
        384    Bob84   18     A
        385   Rita85   18     A
        386  Alice86   21     B
        387    Sam87   19     C
        388  Wendy88   23     A
        389   Tina89   21     C
        390   Zane90   25     D
        391   Tina91   21     D
        392  Wendy92   19     C
        393 Quincy93   19     A
        394    Eva94   24     C
        395   Tina95   25     D
        396    Ian96   25     C
        397   Mona97   22     C
        398    Leo98   25     A
        399    Bob99   23     C
        400  Paul100   19     B

Duplicates are removed

In [ ]:
delete_duplicates = """
DELETE t1 FROM students t1
JOIN students t2 
ON t1.student_id > t2.student_id 
AND t1.name = t2.name 
AND t1.age = t2.age 
AND t1.grade = t2.grade;
"""

cursor.execute(delete_duplicates)
conn.commit()

print("Duplicates removed successfully!")

cursor.close()

Duplicates removed successfully!

In [ ]:
#5 .Write a program to update the grade of a student (given student_id) via a Python input prompt. 
sql = "UPDATE students SET grade = %s WHERE student_id = %s"
val = ("B+", 99)   
cursor.execute(sql, val)
conn.commit()

print(cursor.rowcount, "record updated.")

cursor.close()

0 record updated.

In [ ]:
#6 .Delete a student from the students table using Python input for student_id. 
sql = "DELETE FROM students WHERE name = %s"
val = ("Leo98",)
cursor.execute(sql, val)
conn.commit()

# 7.Write a Python script to insert enrollment records linking students with their courses, ensuring foreign key integrity.

In [ ]:
cursor.execute("SELECT student_id FROM students")
valid_students = {row[0] for row in cursor.fetchall()}

cursor.execute("SELECT course_id FROM courses")
valid_courses = {row[0] for row in cursor.fetchall()}

valid_enrollments, invalid_enrollments = [], []
with open("enrollments.csv") as f:
    for enroll_id, student_id, course_id in list(csv.reader(f))[1:]:
        student_id, course_id = int(student_id), int(course_id)
        if student_id in valid_students and course_id in valid_courses:
            valid_enrollments.append((enroll_id, student_id, course_id))
        else:
            invalid_enrollments.append((student_id, course_id))

print(f"{len(valid_enrollments)} valid enrollments to insert.")
print(f"{len(invalid_enrollments)} invalid enrollments skipped:", invalid_enrollments[:10])

if valid_enrollments:
    cursor.executemany("INSERT IGNORE INTO enrollments VALUES (%s, %s, %s)", valid_enrollments)
    conn.commit()
    print("Inserted successfully.")

cursor.execute("SELECT * FROM enrollments LIMIT 200")
print(cursor.fetchall())

cursor.close(); 
conn.close()

199 valid enrollments to insert.
0 invalid enrollments skipped: []
Inserted successfully.
[(1, 1, 10), (2, 2, 6), (3, 3, 8), (4, 4, 10), (5, 5, 10), (6, 5, 3), (7, 5, 6), (8, 6, 7), (9, 6, 4), (10, 6, 5), (11, 7, 1), (12, 8, 9), (13, 9, 9), (14, 10, 7), (15, 10, 3), (16, 10, 1), (17, 11, 3), (18, 11, 6), (19, 11, 8), (20, 12, 10), (21, 13, 2), (22, 13, 9), (23, 13, 10), (24, 14, 3), (25, 14, 1), (26, 15, 8), (27, 15, 5), (28, 15, 2), (29, 16, 6), (30, 16, 4), (31, 16, 1), (32, 17, 6), (33, 17, 1), (34, 17, 7), (35, 18, 3), (36, 19, 9), (37, 19, 1), (38, 20, 8), (39, 20, 4), (40, 20, 10), (41, 21, 7), (42, 21, 6), (43, 22, 3), (44, 22, 10), (45, 22, 9), (46, 23, 5), (47, 24, 7), (48, 24, 8), (49, 25, 9), (50, 26, 9), (51, 26, 8), (52, 26, 1), (53, 27, 6), (54, 28, 3), (55, 28, 1), (56, 29, 5), (57, 29, 3), (58, 30, 3), (59, 30, 6), (60, 30, 1), (61, 31, 4), (62, 31, 9), (63, 31, 3), (64, 32, 4), (65, 32, 9), (66, 33, 5), (67, 33, 4), (68, 34, 3), (69, 34, 8), (70, 35, 7), (71, 36, 6), (72, 36, 4), (73, 37, 2), (74, 37, 6), (75, 38, 4), (76, 39, 6), (77, 40, 4), (78, 41, 10), (79, 41, 3), (80, 42, 10), (81, 42, 5), (82, 42, 7), (83, 43, 2), (84, 44, 9), (85, 45, 6), (86, 45, 5), (87, 45, 10), (88, 46, 1), (89, 46, 10), (90, 46, 5), (91, 47, 2), (92, 48, 1), (93, 48, 4), (94, 48, 10), (95, 49, 4), (96, 49, 7), (97, 50, 7), (98, 51, 7), (99, 51, 8), (100, 51, 4), (101, 52, 2), (102, 52, 3), (103, 53, 2), (104, 53, 5), (105, 53, 4), (106, 54, 3), (107, 54, 9), (108, 54, 5), (109, 55, 6), (110, 55, 10), (111, 55, 9), (112, 56, 6), (113, 57, 2), (114, 57, 7), (115, 57, 5), (116, 58, 1), (117, 59, 9), (118, 59, 8), (119, 59, 10), (120, 60, 2), (121, 60, 4), (122, 61, 1), (123, 62, 1), (124, 63, 5), (125, 64, 3), (126, 64, 9), (127, 64, 4), (128, 65, 3), (129, 66, 3), (130, 66, 4), (131, 66, 6), (132, 67, 7), (133, 68, 3), (134, 69, 6), (135, 69, 8), (136, 69, 3), (137, 70, 7), (138, 70, 10), (139, 71, 5), (140, 71, 1), (141, 72, 3), (142, 72, 7), (143, 72, 9), (144, 73, 7), (145, 73, 10), (146, 74, 6), (147, 74, 1), (148, 74, 7), (149, 75, 2), (150, 75, 5), (151, 76, 7), (152, 76, 8), (153, 76, 9), (154, 77, 4), (155, 77, 6), (156, 77, 1), (157, 78, 2), (158, 78, 9), (159, 78, 10), (160, 79, 3), (161, 79, 5), (162, 80, 5), (163, 81, 1), (164, 81, 5), (165, 81, 6), (166, 82, 3), (167, 83, 9), (168, 83, 3), (169, 83, 2), (170, 84, 5), (171, 84, 3), (172, 85, 7), (173, 86, 3), (174, 87, 10), (175, 87, 9), (176, 87, 8), (177, 88, 5), (178, 89, 1), (179, 90, 2), (180, 91, 4), (181, 91, 1), (182, 91, 2), (183, 92, 7), (184, 92, 1), (185, 92, 8), (186, 93, 7), (187, 93, 3), (188, 94, 6), (189, 94, 10), (190, 95, 3), (191, 96, 9), (192, 96, 5), (193, 96, 2), (194, 97, 5), (195, 98, 9), (196, 98, 3), (197, 99, 7), (198, 99, 2), (199, 100, 9)]

8  Fetch all students enrolled in a particular course (given course_id as input).

In [84]:
course_id = int(input("Enter course_id to fetch enrolled students: "))

cursor.execute("""
SELECT s.student_id, s.name, s.age, s.grade, c.course_name
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE e.course_id = %s
""", (course_id,))

rows = cursor.fetchall()

print(f"\nStudents enrolled in Course {course_id}:")
if rows:
    for row in rows:
        print(row)   # (student_id, name, age, grade, course_name)
else:
    print("No students found for this course.")

cursor.close()
conn.close()

Students enrolled in Course 2:
(13, 'Yara13', 22, 'B', 'Physics')
(15, 'Quincy15', 24, 'A', 'Physics')
(37, 'Ian37', 21, 'D', 'Physics')
(43, 'Quincy43', 25, 'D', 'Physics')
(47, 'Eva47', 19, 'D', 'Physics')
(52, 'Hannah52', 23, 'A', 'Physics')
(53, 'Bob53', 21, 'C', 'Physics')
(57, 'Nina57', 21, 'B', 'Physics')
(60, 'Yara60', 18, 'B', 'Physics')
(75, 'Quincy75', 23, 'D', 'Physics')
(78, 'Ian78', 22, 'D', 'Physics')
(83, 'Leo83', 18, 'C', 'Physics')
(90, 'Zane90', 25, 'D', 'Physics')
(91, 'Tina91', 21, 'D', 'Physics')
(96, 'Ian96', 25, 'C', 'Physics')
(99, 'Bob99', 23, 'C', 'Physics')

9.  Write a program to display students who are not enrolled in any course.

In [89]:
cursor.execute("""
SELECT s.student_id, s.name, s.age, s.grade
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
WHERE e.student_id IS NULL
""")

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]

df = pd.DataFrame(rows, columns=columns)
print("\nStudents NOT enrolled in any course:")
if df.empty:
    print(" All students are enrolled in some course.")
else:
    print(df.to_string(index=False))

cursor.close()
conn.close()

Students NOT enrolled in any course:
 student_id     name  age grade
        401    Zane1   18     C
        402     Uma2   23     A
        403   Wendy3   22     B
        404  Xander4   22     A
        405  Victor5   19     A
        406     Ian6   19     D
        407     Leo7   22     A
        408    Paul8   24     B
        409   Wendy9   23     B
        410    Leo10   23     A
        411    Uma11   18     C
        412   Rita12   18     B
        413   Yara13   22     B
        414    Bob14   19     C
        415 Quincy15   24     A
        416   Tina16   19     A
        417  Alice17   25     B
        418    Sam18   20     B
        419   Paul19   23     A
        420 Victor20   19     D
        421  Frank21   23     A
        422 Victor22   18     A
        423  Karen23   25     A
        424  Grace24   24     D
        425 Quincy25   25     A
        426   Mona26   20     D
        427    Uma27   22     B
        428   Nina28   23     B
        429    Ian29   23     B
        430   Tina30   23     A
        431   Nina31   22     B
        432 Hannah32   21     A
        433  David33   25     D
        434  Wendy34   22     B
        435  Frank35   25     C
        436   Paul36   22     D
        437    Ian37   21     D
        438   Paul38   20     C
        439 Hannah39   18     A
        440   Zane40   21     A
        441    Ian41   24     D
        442 Quincy42   24     C
        443 Quincy43   25     D
        444   Tina44   19     C
        445 Xander45   23     C
        446   Zane46   25     C
        447    Eva47   19     D
        448    Leo48   22     B
        449    Uma49   25     A
        450    Bob50   22     D
        451  Karen51   18     A
        452 Hannah52   23     A
        453    Bob53   21     C
        454    Leo54   18     C
        455   Yara55   22     A
        456    Eva56   19     C
        457   Nina57   21     B
        458    Eva58   20     A
        459  Oscar59   21     B
        460   Yara60   18     B
        461  Oscar61   23     D
        462   Rita62   23     C
        463 Victor63   20     D
        464 Xander64   19     D
        465 Hannah65   22     D
        466   Nina66   25     D
        467 Victor67   18     A
        468  Karen68   18     A
        469  Grace69   18     D
        470   Jack70   24     A
        471   Nina71   23     B
        472    Ian72   22     D
        473  Grace73   19     A
        474  Grace74   24     C
        475 Quincy75   23     D
        476  Oscar76   19     D
        477  Grace77   22     D
        478    Ian78   22     D
        479 Xander79   24     C
        480   Tina80   22     D
        481  Wendy81   20     A
        482  Karen82   23     B
        483    Leo83   18     C
        484    Bob84   18     A
        485   Rita85   18     A
        486  Alice86   21     B
        487    Sam87   19     C
        488  Wendy88   23     A
        489   Tina89   21     C
        490   Zane90   25     D
        491   Tina91   21     D
        492  Wendy92   19     C
        493 Quincy93   19     A
        494    Eva94   24     C
        495   Tina95   25     D
        496    Ian96   25     C
        497   Mona97   22     C
        498    Leo98   25     A
        499    Bob99   23     C
        500  Paul100   19     B

10. . Perform an INNER JOIN between students and courses using Python to show 
student names along with the courses they are enrolled in.

In [99]:
cursor.execute("""
SELECT s.student_id, s.name, c.course_name
FROM students s
INNER JOIN enrollments e ON s.student_id = e.student_id
INNER JOIN courses c ON e.course_id = c.course_id
""")

print(" Student Name | Course")
print("-------------------------------------------")
for row in cursor.fetchall():
    print(row)

cursor.close()
conn.close()

 Student Name | Course
-------------------------------------------
(1, 'Zane1', 'Statistics')
(2, 'Uma2', 'Economics')
(3, 'Wendy3', 'English Literature')
(4, 'Xander4', 'Statistics')
(5, 'Victor5', 'Statistics')
(5, 'Victor5', 'Chemistry')
(5, 'Victor5', 'Economics')
(6, 'Ian6', 'Computer Science')
(6, 'Ian6', 'Biology')
(6, 'Ian6', 'History')
(7, 'Leo7', 'Mathematics')
(8, 'Paul8', 'Philosophy')
(9, 'Wendy9', 'Philosophy')
(10, 'Leo10', 'Computer Science')
(10, 'Leo10', 'Chemistry')
(10, 'Leo10', 'Mathematics')
(11, 'Uma11', 'Chemistry')
(11, 'Uma11', 'Economics')
(11, 'Uma11', 'English Literature')
(12, 'Rita12', 'Statistics')
(13, 'Yara13', 'Physics')
(13, 'Yara13', 'Philosophy')
(13, 'Yara13', 'Statistics')
(14, 'Bob14', 'Chemistry')
(14, 'Bob14', 'Mathematics')
(15, 'Quincy15', 'English Literature')
(15, 'Quincy15', 'History')
(15, 'Quincy15', 'Physics')
(16, 'Tina16', 'Economics')
(16, 'Tina16', 'Biology')
(16, 'Tina16', 'Mathematics')
(17, 'Alice17', 'Economics')
(17, 'Alice17', 'Mathematics')
(17, 'Alice17', 'Computer Science')
(18, 'Sam18', 'Chemistry')
(19, 'Paul19', 'Philosophy')
(19, 'Paul19', 'Mathematics')
(20, 'Victor20', 'English Literature')
(20, 'Victor20', 'Biology')
(20, 'Victor20', 'Statistics')
(21, 'Frank21', 'Computer Science')
(21, 'Frank21', 'Economics')
(22, 'Victor22', 'Chemistry')
(22, 'Victor22', 'Statistics')
(22, 'Victor22', 'Philosophy')
(23, 'Karen23', 'History')
(24, 'Grace24', 'Computer Science')
(24, 'Grace24', 'English Literature')
(25, 'Quincy25', 'Philosophy')
(26, 'Mona26', 'Philosophy')
(26, 'Mona26', 'English Literature')
(26, 'Mona26', 'Mathematics')
(27, 'Uma27', 'Economics')
(28, 'Nina28', 'Chemistry')
(28, 'Nina28', 'Mathematics')
(29, 'Ian29', 'History')
(29, 'Ian29', 'Chemistry')
(30, 'Tina30', 'Chemistry')
(30, 'Tina30', 'Economics')
(30, 'Tina30', 'Mathematics')
(31, 'Nina31', 'Biology')
(31, 'Nina31', 'Philosophy')
(31, 'Nina31', 'Chemistry')
(32, 'Hannah32', 'Biology')
(32, 'Hannah32', 'Philosophy')
(33, 'David33', 'History')
(33, 'David33', 'Biology')
(34, 'Wendy34', 'Chemistry')
(34, 'Wendy34', 'English Literature')
(35, 'Frank35', 'Computer Science')
(36, 'Paul36', 'Economics')
(36, 'Paul36', 'Biology')
(37, 'Ian37', 'Physics')
(37, 'Ian37', 'Economics')
(38, 'Paul38', 'Biology')
(39, 'Hannah39', 'Economics')
(40, 'Zane40', 'Biology')
(41, 'Ian41', 'Statistics')
(41, 'Ian41', 'Chemistry')
(42, 'Quincy42', 'Statistics')
(42, 'Quincy42', 'History')
(42, 'Quincy42', 'Computer Science')
(43, 'Quincy43', 'Physics')
(44, 'Tina44', 'Philosophy')
(45, 'Xander45', 'Economics')
(45, 'Xander45', 'History')
(45, 'Xander45', 'Statistics')
(46, 'Zane46', 'Mathematics')
(46, 'Zane46', 'Statistics')
(46, 'Zane46', 'History')
(47, 'Eva47', 'Physics')
(48, 'Leo48', 'Mathematics')
(48, 'Leo48', 'Biology')
(48, 'Leo48', 'Statistics')
(49, 'Uma49', 'Biology')
(49, 'Uma49', 'Computer Science')
(50, 'Bob50', 'Computer Science')
(51, 'Karen51', 'Computer Science')
(51, 'Karen51', 'English Literature')
(51, 'Karen51', 'Biology')
(52, 'Hannah52', 'Physics')
(52, 'Hannah52', 'Chemistry')
(53, 'Bob53', 'Physics')
(53, 'Bob53', 'History')
(53, 'Bob53', 'Biology')
(54, 'Leo54', 'Chemistry')
(54, 'Leo54', 'Philosophy')
(54, 'Leo54', 'History')
(55, 'Yara55', 'Economics')
(55, 'Yara55', 'Statistics')
(55, 'Yara55', 'Philosophy')
(56, 'Eva56', 'Economics')
(57, 'Nina57', 'Physics')
(57, 'Nina57', 'Computer Science')
(57, 'Nina57', 'History')
(58, 'Eva58', 'Mathematics')
(59, 'Oscar59', 'Philosophy')
(59, 'Oscar59', 'English Literature')
(59, 'Oscar59', 'Statistics')
(60, 'Yara60', 'Physics')
(60, 'Yara60', 'Biology')
(61, 'Oscar61', 'Mathematics')
(62, 'Rita62', 'Mathematics')
(63, 'Victor63', 'History')
(64, 'Xander64', 'Chemistry')
(64, 'Xander64', 'Philosophy')
(64, 'Xander64', 'Biology')
(65, 'Hannah65', 'Chemistry')
(66, 'Nina66', 'Chemistry')
(66, 'Nina66', 'Biology')
(66, 'Nina66', 'Economics')
(67, 'Victor67', 'Computer Science')
(68, 'Karen68', 'Chemistry')
(69, 'Grace69', 'Economics')
(69, 'Grace69', 'English Literature')
(69, 'Grace69', 'Chemistry')
(70, 'Jack70', 'Computer Science')
(70, 'Jack70', 'Statistics')
(71, 'Nina71', 'History')
(71, 'Nina71', 'Mathematics')
(72, 'Ian72', 'Chemistry')
(72, 'Ian72', 'Computer Science')
(72, 'Ian72', 'Philosophy')
(73, 'Grace73', 'Computer Science')
(73, 'Grace73', 'Statistics')
(74, 'Grace74', 'Economics')
(74, 'Grace74', 'Mathematics')
(74, 'Grace74', 'Computer Science')
(75, 'Quincy75', 'Physics')
(75, 'Quincy75', 'History')
(76, 'Oscar76', 'Computer Science')
(76, 'Oscar76', 'English Literature')
(76, 'Oscar76', 'Philosophy')
(77, 'Grace77', 'Biology')
(77, 'Grace77', 'Economics')
(77, 'Grace77', 'Mathematics')
(78, 'Ian78', 'Physics')
(78, 'Ian78', 'Philosophy')
(78, 'Ian78', 'Statistics')
(79, 'Xander79', 'Chemistry')
(79, 'Xander79', 'History')
(80, 'Tina80', 'History')
(81, 'Wendy81', 'Mathematics')
(81, 'Wendy81', 'History')
(81, 'Wendy81', 'Economics')
(82, 'Karen82', 'Chemistry')
(83, 'Leo83', 'Philosophy')
(83, 'Leo83', 'Chemistry')
(83, 'Leo83', 'Physics')
(84, 'Bob84', 'History')
(84, 'Bob84', 'Chemistry')
(85, 'Rita85', 'Computer Science')
(86, 'Alice86', 'Chemistry')
(87, 'Sam87', 'Statistics')
(87, 'Sam87', 'Philosophy')
(87, 'Sam87', 'English Literature')
(88, 'Wendy88', 'History')
(89, 'Tina89', 'Mathematics')
(90, 'Zane90', 'Physics')
(91, 'Tina91', 'Biology')
(91, 'Tina91', 'Mathematics')
(91, 'Tina91', 'Physics')
(92, 'Wendy92', 'Computer Science')
(92, 'Wendy92', 'Mathematics')
(92, 'Wendy92', 'English Literature')
(93, 'Quincy93', 'Computer Science')
(93, 'Quincy93', 'Chemistry')
(94, 'Eva94', 'Economics')
(94, 'Eva94', 'Statistics')
(95, 'Tina95', 'Chemistry')
(96, 'Ian96', 'Philosophy')
(96, 'Ian96', 'History')
(96, 'Ian96', 'Physics')
(97, 'Mona97', 'History')
(98, 'Leo98', 'Philosophy')
(98, 'Leo98', 'Chemistry')
(99, 'Bob99', 'Computer Science')
(99, 'Bob99', 'Physics')
(100, 'Paul100', 'Philosophy')

11. Write a Python function to search for a student by name (partial matches 
allowed using LIKE).

In [103]:
def search_student_by_name(name_part):
 
    sql = "SELECT student_id, name, age, grade FROM students WHERE name LIKE %s"
    val = ("%" + name_part + "%",)  

    cursor.execute(sql, val)
    rows = cursor.fetchall()

    if rows:
        print("Student ID | Name | Age | Grade")
        print("---------------------------------")
        for row in rows:
            print(row)
    else:
        print("No student found with name containing:", name_part)

    cursor.close()
    conn.close()
search_student_by_name("Rita")

Student ID | Name | Age | Grade
---------------------------------
(12, 'Rita12', 18, 'B')
(62, 'Rita62', 23, 'C')
(85, 'Rita85', 18, 'A')
(412, 'Rita12', 18, 'B')
(462, 'Rita62', 23, 'C')
(485, 'Rita85', 18, 'A')

12.  Add a new column email to the students table using Python and update it 
with random values.

In [106]:
import mysql.connector

cursor.execute("""
UPDATE students s1
JOIN students s2
  ON s1.name = s2.name
SET s1.grade = s2.grade
WHERE s1.student_id BETWEEN 1 AND 100
  AND s2.student_id BETWEEN 101 AND 200;
""")

conn.commit()

cursor.execute("SELECT student_id, name, age, grade, email FROM students WHERE student_id BETWEEN 1 AND 100")
rows = cursor.fetchall()

for row in rows:
    print(row)

cursor.close()
conn.close()

(1, 'Zane1', 18, 'C', 'zane1@school.edu')
(2, 'Uma2', 23, 'A', 'uma2@outlook.com')
(3, 'Wendy3', 22, 'B', 'wendy3@yahoo.com')
(4, 'Xander4', 22, 'A', 'xander4@outlook.com')
(5, 'Victor5', 19, 'A', 'victor5@gmail.com')
(6, 'Ian6', 19, 'D', 'ian6@outlook.com')
(7, 'Leo7', 22, 'A', 'leo7@gmail.com')
(8, 'Paul8', 24, 'B', 'paul8@outlook.com')
(9, 'Wendy9', 23, 'B', 'wendy9@school.edu')
(10, 'Leo10', 23, 'A', 'leo10@yahoo.com')
(11, 'Uma11', 18, 'C', 'uma11@school.edu')
(12, 'Rita12', 18, 'B', 'rita12@outlook.com')
(13, 'Yara13', 22, 'B', 'yara13@yahoo.com')
(14, 'Bob14', 19, 'C', 'bob14@outlook.com')
(15, 'Quincy15', 24, 'A', 'quincy15@school.edu')
(16, 'Tina16', 19, 'A', 'tina16@yahoo.com')
(17, 'Alice17', 25, 'B', 'alice17@outlook.com')
(18, 'Sam18', 20, 'B', 'sam18@gmail.com')
(19, 'Paul19', 23, 'A', 'paul19@school.edu')
(20, 'Victor20', 19, 'D', 'victor20@gmail.com')
(21, 'Frank21', 23, 'A', 'frank21@school.edu')
(22, 'Victor22', 18, 'A', 'victor22@yahoo.com')
(23, 'Karen23', 25, 'A', 'karen23@yahoo.com')
(24, 'Grace24', 24, 'D', 'grace24@gmail.com')
(25, 'Quincy25', 25, 'A', 'quincy25@school.edu')
(26, 'Mona26', 20, 'D', 'mona26@gmail.com')
(27, 'Uma27', 22, 'B', 'uma27@school.edu')
(28, 'Nina28', 23, 'B', 'nina28@yahoo.com')
(29, 'Ian29', 23, 'B', 'ian29@school.edu')
(30, 'Tina30', 23, 'A', 'tina30@outlook.com')
(31, 'Nina31', 22, 'B', 'nina31@school.edu')
(32, 'Hannah32', 21, 'A', 'hannah32@school.edu')
(33, 'David33', 25, 'D', 'david33@school.edu')
(34, 'Wendy34', 22, 'B', 'wendy34@yahoo.com')
(35, 'Frank35', 25, 'C', 'frank35@yahoo.com')
(36, 'Paul36', 22, 'D', 'paul36@outlook.com')
(37, 'Ian37', 21, 'D', 'ian37@school.edu')
(38, 'Paul38', 20, 'C', 'paul38@outlook.com')
(39, 'Hannah39', 18, 'A', 'hannah39@outlook.com')
(40, 'Zane40', 21, 'A', 'zane40@yahoo.com')
(41, 'Ian41', 24, 'D', 'ian41@outlook.com')
(42, 'Quincy42', 24, 'C', 'quincy42@gmail.com')
(43, 'Quincy43', 25, 'D', 'quincy43@gmail.com')
(44, 'Tina44', 19, 'C', 'tina44@outlook.com')
(45, 'Xander45', 23, 'C', 'xander45@yahoo.com')
(46, 'Zane46', 25, 'C', 'zane46@gmail.com')
(47, 'Eva47', 19, 'D', 'eva47@yahoo.com')
(48, 'Leo48', 22, 'B', 'leo48@outlook.com')
(49, 'Uma49', 25, 'A', 'uma49@school.edu')
(50, 'Bob50', 22, 'D', 'bob50@gmail.com')
(51, 'Karen51', 18, 'A', 'karen51@outlook.com')
(52, 'Hannah52', 23, 'A', 'hannah52@yahoo.com')
(53, 'Bob53', 21, 'C', 'bob53@outlook.com')
(54, 'Leo54', 18, 'C', 'leo54@yahoo.com')
(55, 'Yara55', 22, 'A', 'yara55@yahoo.com')
(56, 'Eva56', 19, 'C', 'eva56@school.edu')
(57, 'Nina57', 21, 'B', 'nina57@school.edu')
(58, 'Eva58', 20, 'A', 'eva58@yahoo.com')
(59, 'Oscar59', 21, 'B', 'oscar59@yahoo.com')
(60, 'Yara60', 18, 'B', 'yara60@gmail.com')
(61, 'Oscar61', 23, 'D', 'oscar61@gmail.com')
(62, 'Rita62', 23, 'C', 'rita62@gmail.com')
(63, 'Victor63', 20, 'D', 'victor63@yahoo.com')
(64, 'Xander64', 19, 'D', 'xander64@yahoo.com')
(65, 'Hannah65', 22, 'D', 'hannah65@school.edu')
(66, 'Nina66', 25, 'D', 'nina66@school.edu')
(67, 'Victor67', 18, 'A', 'victor67@outlook.com')
(68, 'Karen68', 18, 'A', 'karen68@school.edu')
(69, 'Grace69', 18, 'D', 'grace69@gmail.com')
(70, 'Jack70', 24, 'A', 'jack70@school.edu')
(71, 'Nina71', 23, 'B', 'nina71@outlook.com')
(72, 'Ian72', 22, 'D', 'ian72@gmail.com')
(73, 'Grace73', 19, 'A', 'grace73@yahoo.com')
(74, 'Grace74', 24, 'C', 'grace74@gmail.com')
(75, 'Quincy75', 23, 'D', 'quincy75@school.edu')
(76, 'Oscar76', 19, 'D', 'oscar76@school.edu')
(77, 'Grace77', 22, 'D', 'grace77@outlook.com')
(78, 'Ian78', 22, 'D', 'ian78@outlook.com')
(79, 'Xander79', 24, 'C', 'xander79@outlook.com')
(80, 'Tina80', 22, 'D', 'tina80@gmail.com')
(81, 'Wendy81', 20, 'A', 'wendy81@school.edu')
(82, 'Karen82', 23, 'B', 'karen82@outlook.com')
(83, 'Leo83', 18, 'C', 'leo83@outlook.com')
(84, 'Bob84', 18, 'A', 'bob84@school.edu')
(85, 'Rita85', 18, 'A', 'rita85@outlook.com')
(86, 'Alice86', 21, 'B', 'alice86@outlook.com')
(87, 'Sam87', 19, 'C', 'sam87@yahoo.com')
(88, 'Wendy88', 23, 'A', 'wendy88@yahoo.com')
(89, 'Tina89', 21, 'C', 'tina89@outlook.com')
(90, 'Zane90', 25, 'D', 'zane90@gmail.com')
(91, 'Tina91', 21, 'D', 'tina91@yahoo.com')
(92, 'Wendy92', 19, 'C', 'wendy92@gmail.com')
(93, 'Quincy93', 19, 'A', 'quincy93@gmail.com')
(94, 'Eva94', 24, 'C', 'eva94@school.edu')
(95, 'Tina95', 25, 'D', 'tina95@outlook.com')
(96, 'Ian96', 25, 'C', 'ian96@school.edu')
(97, 'Mona97', 22, 'C', 'mona97@gmail.com')
(98, 'Leo98', 25, 'A', 'leo98@school.edu')
(99, 'Bob99', 23, 'C', 'bob99@outlook.com')
(100, 'Paul100', 19, 'B', 'paul100@outlook.com')


# Delete students with id between 101 and 200

In [110]:
import mysql.connector

# Delete students with id between 101 and 200
cursor.execute("""
DELETE FROM students
WHERE student_id BETWEEN 101 AND 200;
""")

conn.commit()

print(" Duplicate students (IDs 101-200) deleted successfully.")

cursor.execute("SELECT student_id, name, age, grade, email FROM students ORDER BY student_id")
for row in cursor.fetchall():
    print(row)

cursor.close()
conn.close()

 Duplicate students (IDs 101-200) deleted successfully.
(1, 'Zane1', 18, 'C', 'zane1@school.edu')
(2, 'Uma2', 23, 'A', 'uma2@outlook.com')
(3, 'Wendy3', 22, 'B', 'wendy3@yahoo.com')
(4, 'Xander4', 22, 'A', 'xander4@outlook.com')
(5, 'Victor5', 19, 'A', 'victor5@gmail.com')
(6, 'Ian6', 19, 'D', 'ian6@outlook.com')
(7, 'Leo7', 22, 'A', 'leo7@gmail.com')
(8, 'Paul8', 24, 'B', 'paul8@outlook.com')
(9, 'Wendy9', 23, 'B', 'wendy9@school.edu')
(10, 'Leo10', 23, 'A', 'leo10@yahoo.com')
(11, 'Uma11', 18, 'C', 'uma11@school.edu')
(12, 'Rita12', 18, 'B', 'rita12@outlook.com')
(13, 'Yara13', 22, 'B', 'yara13@yahoo.com')
(14, 'Bob14', 19, 'C', 'bob14@outlook.com')
(15, 'Quincy15', 24, 'A', 'quincy15@school.edu')
(16, 'Tina16', 19, 'A', 'tina16@yahoo.com')
(17, 'Alice17', 25, 'B', 'alice17@outlook.com')
(18, 'Sam18', 20, 'B', 'sam18@gmail.com')
(19, 'Paul19', 23, 'A', 'paul19@school.edu')
(20, 'Victor20', 19, 'D', 'victor20@gmail.com')
(21, 'Frank21', 23, 'A', 'frank21@school.edu')
(22, 'Victor22', 18, 'A', 'victor22@yahoo.com')
(23, 'Karen23', 25, 'A', 'karen23@yahoo.com')
(24, 'Grace24', 24, 'D', 'grace24@gmail.com')
(25, 'Quincy25', 25, 'A', 'quincy25@school.edu')
(26, 'Mona26', 20, 'D', 'mona26@gmail.com')
(27, 'Uma27', 22, 'B', 'uma27@school.edu')
(28, 'Nina28', 23, 'B', 'nina28@yahoo.com')
(29, 'Ian29', 23, 'B', 'ian29@school.edu')
(30, 'Tina30', 23, 'A', 'tina30@outlook.com')
(31, 'Nina31', 22, 'B', 'nina31@school.edu')
(32, 'Hannah32', 21, 'A', 'hannah32@school.edu')
(33, 'David33', 25, 'D', 'david33@school.edu')
(34, 'Wendy34', 22, 'B', 'wendy34@yahoo.com')
(35, 'Frank35', 25, 'C', 'frank35@yahoo.com')
(36, 'Paul36', 22, 'D', 'paul36@outlook.com')
(37, 'Ian37', 21, 'D', 'ian37@school.edu')
(38, 'Paul38', 20, 'C', 'paul38@outlook.com')
(39, 'Hannah39', 18, 'A', 'hannah39@outlook.com')
(40, 'Zane40', 21, 'A', 'zane40@yahoo.com')
(41, 'Ian41', 24, 'D', 'ian41@outlook.com')
(42, 'Quincy42', 24, 'C', 'quincy42@gmail.com')
(43, 'Quincy43', 25, 'D', 'quincy43@gmail.com')
(44, 'Tina44', 19, 'C', 'tina44@outlook.com')
(45, 'Xander45', 23, 'C', 'xander45@yahoo.com')
(46, 'Zane46', 25, 'C', 'zane46@gmail.com')
(47, 'Eva47', 19, 'D', 'eva47@yahoo.com')
(48, 'Leo48', 22, 'B', 'leo48@outlook.com')
(49, 'Uma49', 25, 'A', 'uma49@school.edu')
(50, 'Bob50', 22, 'D', 'bob50@gmail.com')
(51, 'Karen51', 18, 'A', 'karen51@outlook.com')
(52, 'Hannah52', 23, 'A', 'hannah52@yahoo.com')
(53, 'Bob53', 21, 'C', 'bob53@outlook.com')
(54, 'Leo54', 18, 'C', 'leo54@yahoo.com')
(55, 'Yara55', 22, 'A', 'yara55@yahoo.com')
(56, 'Eva56', 19, 'C', 'eva56@school.edu')
(57, 'Nina57', 21, 'B', 'nina57@school.edu')
(58, 'Eva58', 20, 'A', 'eva58@yahoo.com')
(59, 'Oscar59', 21, 'B', 'oscar59@yahoo.com')
(60, 'Yara60', 18, 'B', 'yara60@gmail.com')
(61, 'Oscar61', 23, 'D', 'oscar61@gmail.com')
(62, 'Rita62', 23, 'C', 'rita62@gmail.com')
(63, 'Victor63', 20, 'D', 'victor63@yahoo.com')
(64, 'Xander64', 19, 'D', 'xander64@yahoo.com')
(65, 'Hannah65', 22, 'D', 'hannah65@school.edu')
(66, 'Nina66', 25, 'D', 'nina66@school.edu')
(67, 'Victor67', 18, 'A', 'victor67@outlook.com')
(68, 'Karen68', 18, 'A', 'karen68@school.edu')
(69, 'Grace69', 18, 'D', 'grace69@gmail.com')
(70, 'Jack70', 24, 'A', 'jack70@school.edu')
(71, 'Nina71', 23, 'B', 'nina71@outlook.com')
(72, 'Ian72', 22, 'D', 'ian72@gmail.com')
(73, 'Grace73', 19, 'A', 'grace73@yahoo.com')
(74, 'Grace74', 24, 'C', 'grace74@gmail.com')
(75, 'Quincy75', 23, 'D', 'quincy75@school.edu')
(76, 'Oscar76', 19, 'D', 'oscar76@school.edu')
(77, 'Grace77', 22, 'D', 'grace77@outlook.com')
(78, 'Ian78', 22, 'D', 'ian78@outlook.com')
(79, 'Xander79', 24, 'C', 'xander79@outlook.com')
(80, 'Tina80', 22, 'D', 'tina80@gmail.com')
(81, 'Wendy81', 20, 'A', 'wendy81@school.edu')
(82, 'Karen82', 23, 'B', 'karen82@outlook.com')
(83, 'Leo83', 18, 'C', 'leo83@outlook.com')
(84, 'Bob84', 18, 'A', 'bob84@school.edu')
(85, 'Rita85', 18, 'A', 'rita85@outlook.com')
(86, 'Alice86', 21, 'B', 'alice86@outlook.com')
(87, 'Sam87', 19, 'C', 'sam87@yahoo.com')
(88, 'Wendy88', 23, 'A', 'wendy88@yahoo.com')
(89, 'Tina89', 21, 'C', 'tina89@outlook.com')
(90, 'Zane90', 25, 'D', 'zane90@gmail.com')
(91, 'Tina91', 21, 'D', 'tina91@yahoo.com')
(92, 'Wendy92', 19, 'C', 'wendy92@gmail.com')
(93, 'Quincy93', 19, 'A', 'quincy93@gmail.com')
(94, 'Eva94', 24, 'C', 'eva94@school.edu')
(95, 'Tina95', 25, 'D', 'tina95@outlook.com')
(96, 'Ian96', 25, 'C', 'ian96@school.edu')
(97, 'Mona97', 22, 'C', 'mona97@gmail.com')
(98, 'Leo98', 25, 'A', 'leo98@school.edu')
(99, 'Bob99', 23, 'C', 'bob99@outlook.com')
(100, 'Paul100', 19, 'B', 'paul100@outlook.com')
(401, 'Zane1', 18, 'C', None)
(402, 'Uma2', 23, 'A', None)
(403, 'Wendy3', 22, 'B', None)
(404, 'Xander4', 22, 'A', None)
(405, 'Victor5', 19, 'A', None)
(406, 'Ian6', 19, 'D', None)
(407, 'Leo7', 22, 'A', None)
(408, 'Paul8', 24, 'B', None)
(409, 'Wendy9', 23, 'B', None)
(410, 'Leo10', 23, 'A', None)
(411, 'Uma11', 18, 'C', None)
(412, 'Rita12', 18, 'B', None)
(413, 'Yara13', 22, 'B', None)
(414, 'Bob14', 19, 'C', None)
(415, 'Quincy15', 24, 'A', None)
(416, 'Tina16', 19, 'A', None)
(417, 'Alice17', 25, 'B', None)
(418, 'Sam18', 20, 'B', None)
(419, 'Paul19', 23, 'A', None)
(420, 'Victor20', 19, 'D', None)
(421, 'Frank21', 23, 'A', None)
(422, 'Victor22', 18, 'A', None)
(423, 'Karen23', 25, 'A', None)
(424, 'Grace24', 24, 'D', None)
(425, 'Quincy25', 25, 'A', None)
(426, 'Mona26', 20, 'D', None)
(427, 'Uma27', 22, 'B', None)
(428, 'Nina28', 23, 'B', None)
(429, 'Ian29', 23, 'B', None)
(430, 'Tina30', 23, 'A', None)
(431, 'Nina31', 22, 'B', None)
(432, 'Hannah32', 21, 'A', None)
(433, 'David33', 25, 'D', None)
(434, 'Wendy34', 22, 'B', None)
(435, 'Frank35', 25, 'C', None)
(436, 'Paul36', 22, 'D', None)
(437, 'Ian37', 21, 'D', None)
(438, 'Paul38', 20, 'C', None)
(439, 'Hannah39', 18, 'A', None)
(440, 'Zane40', 21, 'A', None)
(441, 'Ian41', 24, 'D', None)
(442, 'Quincy42', 24, 'C', None)
(443, 'Quincy43', 25, 'D', None)
(444, 'Tina44', 19, 'C', None)
(445, 'Xander45', 23, 'C', None)
(446, 'Zane46', 25, 'C', None)
(447, 'Eva47', 19, 'D', None)
(448, 'Leo48', 22, 'B', None)
(449, 'Uma49', 25, 'A', None)
(450, 'Bob50', 22, 'D', None)
(451, 'Karen51', 18, 'A', None)
(452, 'Hannah52', 23, 'A', None)
(453, 'Bob53', 21, 'C', None)
(454, 'Leo54', 18, 'C', None)
(455, 'Yara55', 22, 'A', None)
(456, 'Eva56', 19, 'C', None)
(457, 'Nina57', 21, 'B', None)
(458, 'Eva58', 20, 'A', None)
(459, 'Oscar59', 21, 'B', None)
(460, 'Yara60', 18, 'B', None)
(461, 'Oscar61', 23, 'D', None)
(462, 'Rita62', 23, 'C', None)
(463, 'Victor63', 20, 'D', None)
(464, 'Xander64', 19, 'D', None)
(465, 'Hannah65', 22, 'D', None)
(466, 'Nina66', 25, 'D', None)
(467, 'Victor67', 18, 'A', None)
(468, 'Karen68', 18, 'A', None)
(469, 'Grace69', 18, 'D', None)
(470, 'Jack70', 24, 'A', None)
(471, 'Nina71', 23, 'B', None)
(472, 'Ian72', 22, 'D', None)
(473, 'Grace73', 19, 'A', None)
(474, 'Grace74', 24, 'C', None)
(475, 'Quincy75', 23, 'D', None)
(476, 'Oscar76', 19, 'D', None)
(477, 'Grace77', 22, 'D', None)
(478, 'Ian78', 22, 'D', None)
(479, 'Xander79', 24, 'C', None)
(480, 'Tina80', 22, 'D', None)
(481, 'Wendy81', 20, 'A', None)
(482, 'Karen82', 23, 'B', None)
(483, 'Leo83', 18, 'C', None)
(484, 'Bob84', 18, 'A', None)
(485, 'Rita85', 18, 'A', None)
(486, 'Alice86', 21, 'B', None)
(487, 'Sam87', 19, 'C', None)
(488, 'Wendy88', 23, 'A', None)
(489, 'Tina89', 21, 'C', None)
(490, 'Zane90', 25, 'D', None)
(491, 'Tina91', 21, 'D', None)
(492, 'Wendy92', 19, 'C', None)
(493, 'Quincy93', 19, 'A', None)
(494, 'Eva94', 24, 'C', None)
(495, 'Tina95', 25, 'D', None)
(496, 'Ian96', 25, 'C', None)
(497, 'Mona97', 22, 'C', None)
(498, 'Leo98', 25, 'A', None)
(499, 'Bob99', 23, 'C', None)
(500, 'Paul100', 19, 'B', None)

13 .. Create a program to count how many students are enrolled per course and 
display results in descending order

In [114]:
import mysql.connector

cursor.execute("""
SELECT c.course_id, c.course_name, COUNT(e.student_id) AS total_students
FROM courses c
LEFT JOIN enrollments e ON c.course_id = e.course_id
GROUP BY c.course_id, c.course_name
ORDER BY total_students DESC;
""")

print("Course ID | Course Name   | Students Enrolled")
print("-------------------------------------------------")
for row in cursor.fetchall():
    print(f"{row[0]:<9} | {row[1]:<18} | {row[2]}")

cursor.close()
conn.close()

Course ID | Course Name   | Students Enrolled
-------------------------------------------------
3         | Chemistry          | 28
9         | Philosophy         | 22
1         | Mathematics        | 21
5         | History            | 21
7         | Computer Science   | 21
6         | Economics          | 20
10        | Statistics         | 19
4         | Biology            | 18
2         | Physics            | 16
8         | English Literature | 13
11        | Mathematics        | 0
12        | Physics            | 0
13        | Chemistry          | 0
14        | Biology            | 0
15        | History            | 0
16        | Economics          | 0
17        | Computer Science   | 0
18        | English Literature | 0
19        | Philosophy         | 0
20        | Statistics         | 0
21        | Mathematics        | 0
22        | Physics            | 0
23        | Chemistry          | 0
24        | Biology            | 0
25        | History            | 0
26        | Economics          | 0
27        | Computer Science   | 0
28        | English Literature | 0
29        | Philosophy         | 0
30        | Statistics         | 0
31        | Mathematics        | 0
32        | Physics            | 0
33        | Chemistry          | 0
34        | Biology            | 0
35        | History            | 0
36        | Economics          | 0
37        | Computer Science   | 0
38        | English Literature | 0
39        | Philosophy         | 0
40        | Statistics         | 0
41        | Mathematics        | 0
42        | Physics            | 0
43        | Chemistry          | 0
44        | Biology            | 0
45        | History            | 0
46        | Economics          | 0
47        | Computer Science   | 0
48        | English Literature | 0
49        | Philosophy         | 0
50        | Statistics         | 0

14 .Write a Python script that accepts a course name as input and returns all 
enrolled students with their grades.

In [117]:
def get_students_by_course(course_name):
    conn = mysql.connector.connect(
        host="localhost",
        user="root",
        password="Revanth123/",
        database="schools_db"
    )
    cursor = conn.cursor()

    query =("""
        SELECT s.student_id, s.name, s.grade
        FROM students s
        INNER JOIN enrollments e ON s.student_id = e.student_id
        INNER JOIN courses c ON e.course_id = c.course_id
        WHERE c.course_name LIKE %s
    """)
    cursor.execute(query, ("%" + course_name + "%",))

    rows = cursor.fetchall()

    if rows:
        print(f"\nStudents enrolled in {course_name}:")
        print("-------------------------------------")
        print(f"{'ID':<5} | {'Name':<20} | Grade")
        print("-------------------------------------")
        for row in rows:
            print(f"{row[0]:<5} | {row[1]:<20} | {row[2]}")
    else:
        print(f"No students found for course '{course_name}'.")

    cursor.close()
    conn.close()

course_input = input("Enter course name: ")
get_students_by_course(course_input)

Students enrolled in Philosophy:
-------------------------------------
ID    | Name                 | Grade
-------------------------------------
8     | Paul8                | B
9     | Wendy9               | B
13    | Yara13               | B
19    | Paul19               | A
22    | Victor22             | A
25    | Quincy25             | A
26    | Mona26               | D
31    | Nina31               | B
32    | Hannah32             | A
44    | Tina44               | C
54    | Leo54                | C
55    | Yara55               | A
59    | Oscar59              | B
64    | Xander64             | D
72    | Ian72                | D
76    | Oscar76              | D
78    | Ian78                | D
83    | Leo83                | C
87    | Sam87                | C
96    | Ian96                | C
98    | Leo98                | A
100   | Paul100              | B

15. Export the contents of the students table into a CSV file using Python.

In [ ]:
import csv

cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()

column_names = [i[0] for i in cursor.description]

with open("students_export.csv", "w", newline="", encoding="utf-8") as f:
    writer = csv.writer(f)
    
    writer.writerow(column_names)
    
    writer.writerows(rows)

print(" Students table exported successfully to students_export.csv")

cursor.close()
conn.close()

 Students table exported successfully to students_export.csv

16. Write a Python program to import student data from a CSV file into the 
students table.

In [ ]:
with open("./students.csv", "r", encoding="utf-8") as f:
    reader = csv.reader(f)
    
    next(reader)
    
    for row in reader:
        student_id, name, age, grade, email = row 
        cursor.execute("""
    INSERT IGNORE INTO students (student_id, name, age, grade, email)
    VALUES (%s, %s, %s, %s, %s)
""", (student_id, name, age, grade, email))
        
conn.commit()

print(" Students data imported successfully from CSV!")

cursor.close()
conn.close()

 Students data imported successfully from CSV!

17 .. Create a stored procedure in MySQL (e.g.,GetStudentCourses(student_id)) and call it from Python.

In [124]:
student_id = int(input("Enter Student ID: "))

cursor.callproc("GetStudentCourses", [student_id])

for result in cursor.stored_results():
    rows = result.fetchall()
    print("Student ID | Name   | Course    | Grade")
    print("---------------------------------------")
    for row in rows:
        print(f"{row[0]:<10} | {row[1]:<9} | {row[2]:<16} | {row[3]}")
        
cursor.close()
conn.close()

Student ID | Name   | Course    | Grade
---------------------------------------
2          | Uma2      | Economics        | A

C:\Users\16052\AppData\Local\Temp\ipykernel_23428\3846966358.py:5: DeprecationWarning: Call to deprecated function stored_results. Reason: The property counterpart 'stored_results' will be added in a future release, and this method will be removed.
  for result in cursor.stored_results():

18 .. Handle exceptions in Python to gracefully catch duplicate entries (e.g., 
inserting a student with the same ID).

In [ ]:
import mysql.connector
from mysql.connector import Error, IntegrityError

try:
    conn = mysql.connector.connect(
        host="localhost",
        user="root",
        password="Revanth123/",
        database="schools_db"
    )
    cursor = conn.cursor()

    student = (1, "Zane1", 18, "A", "zane1@school.edu")   

    try:
        cursor.execute("""
            INSERT INTO students (student_id, name, age, grade, email)
            VALUES (%s, %s, %s, %s, %s)
        """, student)
        conn.commit()
        print(" Student inserted successfully.")

    except IntegrityError as e:     #when violate database rules
        if e.errno == 1062:         #Duplicate primary key
            print(f" Duplicate entry: Student with ID {student[0]} already exists.")
        else:
            print(f" Database error: {e}")

except Error as e:
    print(f" Connection error: {e}")

finally:
    if conn.is_connected():
        cursor.close()
        conn.close()
        print(" MySQL connection closed.")

 Duplicate entry: Student with ID 1 already exists.
 MySQL connection closed.

19. Write a program to implement transactions in Python: Insert a student , Enroll them in a course ,Roll back if the second query fails

In [ ]:
import mysql.connector
from mysql.connector import Error

try:
    conn.autocommit = False  

    try:
        student = (101, "NewStudent", 20, "B", "newstudent@example.com")
        cursor.execute("""
            INSERT INTO students (student_id, name, age, grade, email)
            VALUES (%s, %s, %s, %s, %s)
        """, student)

        enrollment = (101, 999)   
        cursor.execute("""
            INSERT INTO enrollments (student_id, course_id)
            VALUES (%s, %s)
        """, enrollment)

        conn.commit()
        print(" Transaction successful: Student inserted & enrolled.")

    except Error as e:
        conn.rollback()
        print(f" Transaction failed, rolled back. Error: {e}")

except Error as e:
    print(f" Connection error: {e}")

finally:
    if conn.is_connected():
        cursor.close()
        conn.close()
        print("MySQL connection closed.")

 Transaction failed, rolled back. Error: 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`schools_db`.`enrollments`, CONSTRAINT `enrollments_ibfk_2` FOREIGN KEY (`course_id`) REFERENCES `courses` (`course_id`))
MySQL connection closed.

20. Close the database connection safely in Python, ensuring both cursor and connection are properly closed.

In [ ]:
import mysql.connector

try:
    cursor.execute("SELECT * FROM students LIMIT 5;")
    for row in cursor.fetchall():
        print(row)
finally:
    if cursor:
        cursor.close()
    if conn:
        conn.close()
    print("Database connection closed safely.")

(1, 'Zane1', 18, 'C', 'zane1@school.edu')
(2, 'Uma2', 23, 'A', 'uma2@outlook.com')
(3, 'Wendy3', 22, 'B', 'wendy3@yahoo.com')
(4, 'Xander4', 22, 'A', 'xander4@outlook.com')
(5, 'Victor5', 19, 'A', 'victor5@gmail.com')
Database connection closed safely.